; domain
(define (domain freezing-biscuits-cookies)
  (:requirements :strips :typing)
  
  (:types 
    item
  )

  (:predicates 
    (in-container ?i - item)
    (airtight-container ?i - item)
    (in-lined-tin ?i - item)
    (separated ?i - item)
    (in-freezer ?i - item)
    (thawed ?i - item)
  )
  
  (:action place-in-container
    :parameters (?i - item)
    :precondition (and (not (in-container ?i)))
    :effect (and (in-container ?i)))

  (:action separate-using-paper
    :parameters (?i - item)
    :precondition (and (in-container ?i) (not (in-lined-tin ?i)))
    :effect (and (in-lined-tin ?i)))

  (:action place-in-freezer
    :parameters (?i - item)
    :precondition (and (in-lined-tin ?i) (not (in-freezer ?i)))
    :effect (and (in-freezer ?i)))

  (:action thaw
    :parameters (?i - item)
    :precondition (in-freezer ?i)
    :effect (and (thawed ?i) (not (in-freezer ?i)))
  )
)

; problem
(define (problem freeze-biscuits-cookies)
  (:domain freezing-biscuits-cookies)
  
  (:objects
    cookies - item
    baking-paper - item
    bowl - item
    freezer - item
    tray - item
  )
  
  (:init
    (not (in-container cookies))
    (airtight-container bowl)
    (not (in-lined-tin cookies))
    (not (in-freezer cookies))
    (not (thawed cookies))
  )
  
  (:goal
    (and
      (thawed cookies)
    )
  )
)

; plan
1. (place-in-container cookies)
   added: (in-container cookies)
   goals met: 0 of 1
2. (separate-using-paper cookies)
   added: (in-lined-tin cookies)
   goals met: 0 of 1
3. (place-in-freezer cookies)
   added: (in-freezer cookies)
   goals met: 0 of 1
4. (thaw cookies)
   deleted: (in-freezer cookies)
   added: (thawed cookies)
   goals met: 1 of 1
